Revit 2027 API
IFCLegacyStairOrRamp.GetWalkLines Method
 Gets walk lines.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<IList<Curve>> GetWalkLines()
Public Function GetWalkLines As IList(Of IList(Of Curve))
public:
IList<IList<Curve^>^>^ GetWalkLines()
member GetWalkLines : unit -> IList<IList<Curve>>
Return Value
IList<IList<Curve>>
 The walk lines.
See Also
Reference
IFCLegacyStairOrRamp Class
Autodesk.Revit.DB.IFC Namespace